In [1]:
import pandas as pd
import numpy as np

In [2]:
sozlukVerisi = {"Istanbul" : [30,29,np.nan],"Anakara" : [20,np.nan,25],"Izmir" : [40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [3]:
havaDurumuDataFrame

   Istanbul  Anakara  Izmir
0      30.0     20.0     40
1      29.0      NaN     39
2       NaN     25.0     38

In [4]:
havaDurumuDataFrame.dropna() #boş olanlar gidiyor

   Istanbul  Anakara  Izmir
0      30.0     20.0     40

In [5]:
havaDurumuDataFrame.dropna(axis = 1)

   Izmir
0     40
1     39
2     38

In [6]:
yeniVeri = {"Istanbul" : [30,29,np.nan],"Anakara" : [20,np.nan,25],"Izmir" : [40,39,38],"Antalya":[45,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)

In [7]:
yeniDataFrame

   Istanbul  Anakara  Izmir  Antalya
0      30.0     20.0     40     45.0
1      29.0      NaN     39      NaN
2       NaN     25.0     38      NaN

In [8]:
yeniDataFrame.dropna(axis=1,thresh=2)

   Istanbul  Anakara  Izmir
0      30.0     20.0     40
1      29.0      NaN     39
2       NaN     25.0     38

In [9]:
yeniDataFrame.fillna(20) #non olanlara 20 doldur

   Istanbul  Anakara  Izmir  Antalya
0      30.0     20.0     40     45.0
1      29.0     20.0     39     20.0
2      20.0     25.0     38     20.0

## groupby

In [10]:
maasSozlugu = {"Departman" : ["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
              "Çalışşan İsmi" : ["Ahmet","Mehmet","Atil","Burak","Zeynep","Fatma"],
              "Maas" : [100,150,235,340,560,670]}

In [11]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [12]:
maasDataFrame

   Departman Çalışşan İsmi  Maas
0    Yazılım         Ahmet   100
1    Yazılım        Mehmet   150
2  Pazarlama          Atil   235
3  Pazarlama         Burak   340
4      Hukuk        Zeynep   560
5      Hukuk         Fatma   670

In [13]:
grupObjesi = maasDataFrame.groupby("Departman")

In [14]:
grupObjesi.count()

           Çalışşan İsmi  Maas
Departman
Hukuk                  2     2
Pazarlama              2     2
Yazılım                2     2

In [15]:
grupObjesi.max()

          Çalışşan İsmi  Maas
Departman
Hukuk            Zeynep   670
Pazarlama         Burak   340
Yazılım          Mehmet   150

In [16]:
grupObjesi.min()

          Çalışşan İsmi  Maas
Departman
Hukuk             Fatma   560
Pazarlama          Atil   235
Yazılım           Ahmet   100

In [17]:
grupObjesi.describe()

           Maas
          count   mean        std    min     25%    50%     75%    max
Departman
Hukuk       2.0  615.0  77.781746  560.0  587.50  615.0  642.50  670.0
Pazarlama   2.0  287.5  74.246212  235.0  261.25  287.5  313.75  340.0
Yazılım     2.0  125.0  35.355339  100.0  112.50  125.0  137.50  150.0